<template>
  <div class="changelog">
    <div class="section">
      <h2>Текущая версия</h2>
      <h1>{{ $store.getters.appVersion }}</h1>
    </div>
    <div class="section">
      <h2>История версий</h2>
      <el-timeline>
        <el-timeline-item
          v-for="(version, index) in changelog"
          :key="index"
          :timestamp="version.date"
        >
          <div class="version">{{ version.number }}</div>
          <p>{{ version.content }}</p>
        </el-timeline-item>
      </el-timeline>
    </div>
  </div>
</template>

<script lang="ts">
import { Component, Vue } from 'vue-property-decorator'

@Component
export default class Changelog extends Vue {
  private changelog = [
    {
      number: '0.6.1',
      content: `
            Исправлены полосы прокрутки на доске задач;
            исправлена навигация при возврате на предыдущие страницы через кнопки браузера;
            добавлен логотип на странице авторизации
          `,
      date: '18.08.2020'
    },
    {
      number: '0.6.0',
      content: `
            Исправлена ошибка при которой не удавалось создать новую задачу в общем списке с видом доски;
            исправлено поведение иконки чек-листа в диалоговом окне задачи;
            возможность убрать команду на странице проекта через контекстное меню;
            возможность добавления существующей команды на странице проекта
          `,
      date: '14.08.2020'
    },
    {
      number: '0.5.2',
      content: `
            Редактирование и удаление пунктов чек-листа;
            перечёркивание выполненного пункта чек-листа;
            исправлена ошибка исчезновения команд после редактирования описания проекта
          `,
      date: '12.08.2020'
    },
    {
      number: '0.5.1',
      content: `
            Cохранение и подгрузка пунктов чек-листа;
            автосохранение данных при изменении описания или заголовка на странице проекта;
            отключена сортировка по номеру телефона
          `,
      date: '12.08.2020'
    },
    {
      number: '0.5.0',
      content: `
            Чек-листы для задач
          `,
      date: '07.08.2020'
    },
    {
      number: '0.4.4',
      content: `
            Улучшеная валидация логина при создании нового пользователя,
            возможность убрать сразу несколько пользователей из команды
          `,
      date: '06.08.2020'
    },
    {
      number: '0.4.3',
      content: `
            Автообновление таблицы после добавления пользователя в команду,
            валидация логина на отсутствие запрещённых символов
          `,
      date: '05.08.2020'
    },
    {
      number: '0.4.2',
      content: `
            Исправлено перекрытие логотипа списком проектов,
            исправлена прокрутка во вкладках,
            исправлено дублирование проектов в боковом меню
          `,
      date: '05.08.2020'
    },
    {
      number: '0.4.1',
      content: `
            Возможность убрать пользователя из команды (ПКМ > Убрать из команды),
            скрыты уже добавленные пользователи при добавлении нового к команде,
            исправлено добавление пользователя на странице команды,
            исправлены инициалы ответственного у задачи в режиме доски,
            более унифицированный внешний вид выпадающих списков и контекстных меню,
            увеличен логотип
          `,
      date: '05.08.2020'
    },
    {
      number: '0.4.0',
      content: `
            Удалён лишний фильтр по проекту на странице задач проекта,
            исправлен вылет ошибки при проверке актуальности авторизационных данных,
            исправлен скролл и подключены фильтры/сортировка для задач в виде доски,
            отображение проектов и добавление (вместо нового) существующего пользователя на странице команды,
            интегрирован логотип НОЦ
          `,
      date: '04.08.2020'
    },
    {
      number: '0.3.2',
      content: `
            Выделение нескольких элементов таблицы через Shift,
            исправлено поведение иконки выпадающего списка в разделе фильтров
          `,
      date: '03.08.2020'
    },
    {
      number: '0.3.1',
      content: `
            Улучшена подгрузка проектов в боковом меню,
            улучшена работа уведомлений об ошибках
          `,
      date: '30.07.2020'
    },
    {
      number: '0.3.0',
      content: `
            Добавлена страница команды,
            заменена иконка сортировки,
            добавлена стрелка выпадающего меню для фильтров с динамическими значениями`,
      date: '29.07.2020'
    },
    {
      number: '0.2.1',
      content: `Исправлена ошибка при удалении невыгруженного вложения`,
      date: '28.07.2020'
    },
    {
      number: '0.2.0',
      content: `Исправления ошибок, фильтрация по полям, автосортировка по умолчанию с указанием названием поля`,
      date: '28.07.2020'
    },
    {
      number: '0.1.8',
      content: `Исправления ошибок`,
      date: '23.07.2020'
    },
    {
      number: '0.1.7',
      content: `Добавлена валидация поля Крайний срок,
            исправлена ошибка при редактировании пользователя,
            улучшено редактирование данных аккаунта`,
      date: '23.07.2020'
    },
    {
      number: '0.1.6',
      content:
        'Исправлено поле Должность в диалоге пользователя и убраны поля Прав и Команд, исправлено отображение пользователей в команде',
      date: '22.07.2020'
    },
    {
      number: '0.1.5',
      content:
        'Возможность сменить статус задачи на Новое, новые поля сортировки для проектов и пользователей, исправления ошибок',
      date: '22.07.2020'
    },
    {
      number: '0.1.4',
      content: 'Добавлено отображение задач в виде доски на странице проекта',
      date: '21.07.2020'
    }
  ]
}
</script>

<style lang="scss" scoped>
.section {
  margin-bottom: 30px;
  h2 {
    font-size: 14px;
    font-weight: 500;
    margin-top: 10px;
    margin-bottom: 15px;
  }
  h1 {
    font-size: 28px;
    font-weight: 600;
    margin-top: 15px;
  }
}
.el-timeline {
  padding: 10px 2px;
}
.version {
  font-size: 13px;
  font-weight: 600;
  margin-bottom: 8px;
}
p {
  color: var(--text) !important;
  font-size: 13px;
  line-height: normal;
}
</style>
